// من هنا يمكنك التعديل على الصفحة كل دالة
//  سوف يكون لها شرح مختصر
// ****************************************************************

// قم بتغيير الاسم
// Genius WiFi
// الى اسم شبكتك
if (document.getElementById("title")) {
  changeName("Genius WiFi");
}
// ****************************************************************

// نوع بيانات الكرت
// ارقام
// احرف
// ********
// اذا كان الكرت المستخدم
// اسم مستخدم وكلمة مرور مختلفة = "مختلفة"
// اسم مستخدم وكلمة مرور متشابهة = "متشابهة"
// اسم مستخدم وكلمة مرور فارغة = "فارغة"
// ************
//  قم بتغيرها بما يتناسب مع نظام الكروت لديك
if (document.getElementById("uname")) {
  changeTypeOfCard("ارقام", "مختلفة");
}
// ****************************************************************

// هذا الدالة تقوم بإنشاء باقات الكروت
//  200 = السعر
//  600 M = حجم الكرت M = ميجا G = جيجا
// 2 day = صلاحية الكرت
if (document.getElementById("pri")) {
  price(200, "000 M", "1 day");
  price(400, "000 M", "2 day");
  price(800, "000 M", "7 day");
  price(2000, "000 G", "30 day");
}
// ****************************************************************

// تعمل هذا الدالة على تحديد وقت اتاحة التواصل مع مسؤؤل الشبكة
// يمكنك تغيير الوقت بما يتناسب معك شرط كتابة الوقت بنس الصيغة
// تنبية لا تقم بتعديل او حدف اخر برميتر timeNewString()
checkAvailable(
  [
    "09:00 am", // من الساعه 9 صباحآ
    "12:00 pm", // الى الساعة 12 ظهرآ
  ],
  [
    "05:00 pm", // الوقت التاني من الساعة 5 عصرآ
    "09:00 pm", // الى الساعة 9 مساء
  ],
  timeNewString(), // لاتقم بحذف او تعديل هذا الدالة
  "777777777 ca",  // ca = رقم الاتصال الهاتفي
  "777777777 wa"   // wa = رقم الواتساب لتواصل
);
